DataProcessors/ПереносДанныхИзИнформационныхБаз1СПредприятия77.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>ПереносДанныхИзИнформационныхБаз1СПредприятия77</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТаблицаПути</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Путь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/КонвертацииИзИнформационныхБаз1СПредприятия77.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>КонвертацииИзИнформационныхБаз1СПредприятия77</Name>
			<Comment>Конвертации из информационных баз 1С:Предприятия</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРелиза</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонвертацияПомощник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонвертацияОбработка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонвертацияПравила</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеПомощник</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОписаниеПомощника</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОбработка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеПравила</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ПереносДанныхИзИнформационныхБаз1СПредприятия77/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция получает список ИБ 1С:Предприятия 7.7 из системного реестра
//
Функция ПолучитьСписокИБ77() Экспорт
	
	Попытка
		ScrptCtrl=Новый COMObject("MSScriptControl.ScriptControl");
		ScrptCtrl.Language="vbscript";
		ScrptCtrl.AddCode("
		|Function Get1CV77Titles()
		|	const HKEY_CURRENT_USER = &H80000001
		|	Set oReg=GetObject(""winmgmts:{impersonationLevel=impersonate}!\\.\root\default:StdRegProv"")
		|	strKeyPath = ""Software\1C\1Cv7\7.7\Titles""
		|	oReg.EnumValues HKEY_CURRENT_USER, strKeyPath, arrValues
		|	strInfo=vbNullString
		|	if isArray(arrValues) then
		|		For i = LBound(arrValues) To UBound(arrValues)
		|			call oReg.GetStringValue(HKEY_CURRENT_USER,strKeyPath,arrValues(i),Value)
		|			strInfo=strInfo & arrValues(i) & vbTab & Value & vbCrLf
		|		Next
		|	end if
		|	Get1CV77Titles = strInfo
		|End Function
		|");
		Текст=СокрЛП(ScrptCtrl.Run("Get1CV77Titles"));
		
	Исключение
		Возврат ОписаниеОшибки();
		
	КонецПопытки;
	
	ТаблицаИБ = Новый ТаблицаЗначений;
	ТаблицаИБ.Колонки.Добавить("Имя");
	ТаблицаИБ.Колонки.Добавить("Путь");
	ТаблицаИБ.Колонки.Добавить("ЯвляетсяКонфигурациейЗиК");
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат ТаблицаИБ;
	КонецЕсли;
	
	ФайлОписанияМетаданных = Новый ТекстовыйДокумент;
	
	МассивИменФайлов = Новый Массив;
	МассивИменФайлов.Добавить("1cv7.dd");
	МассивИменФайлов.Добавить("1cv7.dds");
	
	Для Номер = 1 По СтрЧислоСтрок(Текст) Цикл
		СтрБазы		= СтрПолучитьСтроку(Текст, Номер);
		Разд		= Найти(СтрБазы, Символы.Таб);
		Путь		= Лев(СтрБазы, Разд-1);
		Название	= Прав(СтрБазы, СтрДлина(СтрБазы) - Разд);
		
		ЯвляетсяКонфигурациейЗиК = Ложь;
		Для Каждого ИмяФайла Из МассивИменФайлов Цикл
			ФайлДляПроверки = Новый Файл(Путь + ИмяФайла);
			Если ФайлДляПроверки.Существует() Тогда
				ФайлОписанияМетаданных.Прочитать(Путь + ИмяФайла);
				ЯвляетсяКонфигурациейЗиК = Найти(ФайлОписанияМетаданных.ПолучитьТекст(), "CJ447") > 0;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		НоваяСтрока = ТаблицаИБ.Добавить();
		НоваяСтрока.Имя							= Название;
		НоваяСтрока.Путь						= Путь;
		НоваяСтрока.ЯвляетсяКонфигурациейЗиК	= ЯвляетсяКонфигурациейЗиК;
	КонецЦикла;
	
	ТаблицаИБ.Сортировать("ЯвляетсяКонфигурациейЗиК УБЫВ, Имя");
	
	Возврат ТаблицаИБ;
	
КонецФункции

// Процедура записывает файлы конвертации на диск
//
Процедура ЗаписатьФайлыДляПереносаНаДиск(Знач Конвертация, ПутьДляСохранения, ЗаписыватьСПомощником = Истина) Экспорт
	Перем КонвертацияПомощник, КонвертацияОписаниеПомощника, КонвертацияОбработка, КонвертацияПравила;
	
	Попытка
		КаталогНаДиске = Новый Файл(ПутьДляСохранения);
		Если Не КаталогНаДиске.Существует() Тогда
			СоздатьКаталог(ПутьДляСохранения);
		КонецЕсли;
		
		Если ТипЗнч(Конвертация) = Тип("СправочникВыборка.КонвертацииИзИнформационныхБаз1СПредприятия77") Тогда
			КонвертацияОбработка			= Конвертация.ХранилищеОбработка.Получить();
			КонвертацияПравила				= Конвертация.ХранилищеПравила.Получить();
			
			Если	КонвертацияОбработка = Неопределено
				ИЛИ	КонвертацияПравила = Неопределено Тогда
				КонвертацияОбработка			= Справочники.КонвертацииИзИнформационныхБаз1СПредприятия77.ПолучитьМакет(Конвертация.КонвертацияОбработка + "_ert");
				КонвертацияПравила				= Справочники.КонвертацииИзИнформационныхБаз1СПредприятия77.ПолучитьМакет(Конвертация.КонвертацияПравила + "_xml");
			КонецЕсли;
			КонвертацияОбработка.Записать(ПутьДляСохранения + Конвертация.КонвертацияОбработка + ".ert");
			КонвертацияПравила.Записать(ПутьДляСохранения + Конвертация.КонвертацияПравила + ".xml");
			
			Если ЗаписыватьСПомощником Тогда
				КонвертацияПомощник				= Конвертация.ХранилищеПомощник.Получить();
				КонвертацияОписаниеПомощника	= Конвертация.ХранилищеОписаниеПомощника.Получить();
				
				Если	КонвертацияПомощник = Неопределено
					ИЛИ	КонвертацияОписаниеПомощника = Неопределено Тогда
					КонвертацияПомощник				= Справочники.КонвертацииИзИнформационныхБаз1СПредприятия77.ПолучитьМакет(Конвертация.КонвертацияПомощник + "_ert");
					КонвертацияОписаниеПомощника	= Справочники.КонвертацииИзИнформационныхБаз1СПредприятия77.ПолучитьМакет(Конвертация.КонвертацияПомощник + "_efd");
				КонецЕсли;
				
				КонвертацияПомощник.Записать(ПутьДляСохранения + Конвертация.КонвертацияПомощник + ".ert");
				КонвертацияОписаниеПомощника.Записать(ПутьДляСохранения + Конвертация.КонвертацияПомощник + ".efd");
			КонецЕсли;
			
		Иначе
			Если ТипЗнч(Конвертация) = Тип("СправочникСсылка.КонвертацииИзИнформационныхБаз1СПредприятия77") Тогда
				Конвертация = Конвертация.ПолучитьОбъект();
			КонецЕсли;
			
			КонвертацияОбработка			= Конвертация.ПолучитьМакет("V77Exp_ert");
			КонвертацияПравила				= Конвертация.ПолучитьМакет("PrB_xml");
			КонвертацияОбработка.Записать(ПутьДляСохранения + "V77Exp.ert");
			КонвертацияПравила.Записать(ПутьДляСохранения + "PrB.xml");
			
			Если ЗаписыватьСПомощником Тогда
				КонвертацияПомощник				= Конвертация.ПолучитьМакет("PrB_Wiz_ert");
				КонвертацияОписаниеПомощника	= Конвертация.ПолучитьМакет("PrB_Wiz_efd");
				КонвертацияПомощник.Записать(ПутьДляСохранения + "PrB_Wiz.ert");
				КонвертацияОписаниеПомощника.Записать(ПутьДляСохранения + "PrB_Wiz.efd");
			КонецЕсли;
			
		КонецЕсли;
		#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если ЗаписыватьСПомощником Тогда
			Предупреждение("Файлы конвертации записаны в каталог: "+ ПутьДляСохранения);
		КонецЕсли;
		#КонецЕсли
	
	Исключение
		#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если ЗаписыватьСПомощником Тогда
			Предупреждение("Файлы конвертации записать не удалось");
		КонецЕсли;
		#КонецЕсли
		
	КонецПопытки;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
